tests/Fixtures/ListOfCountryNamesByName.soap12.xml

<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
    <soap12:Body>
        <ListOfCountryNamesByName xmlns="http://www.oorsprong.org/websamples.countryinfo"/>
    </soap12:Body>
</soap12:Envelope>