src/main/resources/example-requests/country-info.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <ListOfCountryNamesByCode xmlns="http://www.oorsprong.org/websamples.countryinfo">
    </ListOfCountryNamesByCode>
  </soap:Body>
</soap:Envelope> 