RESTAssuredAutomation/SoapRequest/ListOfContinentsByName.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope 	xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <ListOfContinentsByName xmlns="http://www.oorsprong.org/websamples.countryinfo">
    </ListOfContinentsByName>
  </soap:Body>
</soap:Envelope>