TestServicesSoap/src/test/resources/soap/filelenguaje.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.oorsprong.org/websamples.countryinfo">
    <soapenv:Header/>
    <soapenv:Body>
        <web:LanguageName>
            <web:sISOCode>%s</web:sISOCode>
        </web:LanguageName>
    </soapenv:Body>
</soapenv:Envelope>