RestSharpTemplate/Xmls/CountryNamesGroupedByContinentXML.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.oorsprong.org/websamples.countryinfo">
   <soapenv:Header/>
   <soapenv:Body>
      <web:ListOfCountryNamesGroupedByContinent/>
   </soapenv:Body>
</soapenv:Envelope>
