src/test/resources/data/demo/http/country_list_request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ListOfLanguagesByName xmlns="http://www.oorsprong.org/websamples.countryinfo">
        </ListOfLanguagesByName>
    </soap:Body>
</soap:Envelope>