Laboratorio_07/Propuestos_2/postmanXML.xml

<!-- 
URL: http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso 
metodo: POST
descripción: listado de paises  
Body;
-->
<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <ListOfCountryNamesByName xmlns="http://www.oorsprong.org/websamples.countryinfo">
    </ListOfCountryNamesByName>
  </soap12:Body>
</soap12:Envelope>

<!-- 
URL: http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso 
metodo: POST
descripción: Capital del pais que esta dentro de la etiqueta sCountryISOCode 
Body;
-->
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <CapitalCity xmlns="http://www.oorsprong.org/websamples.countryinfo">
      <sCountryISOCode>US</sCountryISOCode>
    </CapitalCity>
  </soap:Body>
</soap:Envelope>