SOAP UI project files (.xml)/CurrencyName_SOAP_API_Request_XML.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <CurrencyName xmlns="http://www.oorsprong.org/websamples.countryinfo">
      <sCurrencyISOCode>string</sCurrencyISOCode>
    </CurrencyName>
  </soap:Body>
</soap:Envelope>
