EXAMPLES/soap_request.xml

<soap-env:Envelope xmlns:soap-env="http://www.w3.org/2003/05/soap-envelope">
  <soap-env:Body>
    <ns0:ListOfContinentsByName xmlns:ns0="http://www.oorsprong.org/websamples.countryinfo"/>
  </soap-env:Body>
</soap-env:Envelope>