data/payloads/soap_country_language.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <LanguageName xmlns="http://www.oorsprong.org/websamples.countryinfo">
      <sISOCode>hi</sISOCode>
    </LanguageName>
  </soap:Body>
</soap:Envelope>
