SOAP/resources/catalog/Currency_Envelope.txt

<?xml version="1.0" encoding="utf-8"?>
<!--Envelope that encapsulates the provided data: sCountryISOCode specific to the currency request-->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <CountryCurrency xmlns="http://www.oorsprong.org/websamples.countryinfo">
      <sCountryISOCode>?</sCountryISOCode>
    </CountryCurrency>
  </soap:Body>
</soap:Envelope>