SOAP/resources/catalog/International_Phone_Code_Envelope.xml

<?xml version="1.0" encoding="utf-8"?>
<!--SOAP envelope consumed by the service at http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso.
It calls the method CountryIntPhoneCode and provides as input the sCountryISOCode.-->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <CountryIntPhoneCode xmlns="http://www.oorsprong.org/websamples.countryinfo">
      <sCountryISOCode>?</sCountryISOCode>
    </CountryIntPhoneCode>
  </soap:Body>
</soap:Envelope>