SOAP/resources/catalog/Capital_City_Envelope.txt

<?xml version="1.0" encoding="utf-8"?>
<!--Envelope that encapsulates the provided data: sCountryISOCode specific to the capital city request-->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <CapitalCity xmlns="http://www.oorsprong.org/websamples.countryinfo">
      <sCountryISOCode>?</sCountryISOCode>
    </CapitalCity>
  </soap:Body>
</soap:Envelope>