axelor-core/src/test/resources/data/ws-test/ws-CountryInfoService.tmpl

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <CapitalCity xmlns="http://www.oorsprong.org/websamples.countryinfo">
      <sCountryISOCode>$ISOCode$</sCountryISOCode>
    </CapitalCity>
  </soap12:Body>
</soap12:Envelope>