.metadata/.plugins/org.eclipse.core.resources/.history/29/a087ebd0d4c8001a1586a9901b37332e

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <CapitalCity xmlns="http://www.oorsprong.org/websamples.countryinfo">
            <sCountryISOCode>{{CountryCode}}</sCountryISOCode>
        </CapitalCity>
    </Body>
</Envelope>